---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralFoundationThickness
source: html/f9fb164f-c7b0-e9ec-29c4-5652c51b4de1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralFoundationThickness Property

"Foundation Thickness"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralFoundationThickness { get; }
```